УНФ_ТЕСТ/src/Catalogs/КП_АвтозапускПроцессов/КП_АвтозапускПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КП_АвтозапускПроцессов</name>
  <attributes>
    <name>ВидПроцесса</name>
    <type>
      <types>CatalogRef.КП_ВидыПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочаяГруппа</name>
    <type>
      <types>CatalogRef.КП_РабочиеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМетаданных</name>
    <type>
      <types>CatalogRef.КП_СписокМетаданных</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстФункции</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Включено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

УНФ_ТЕСТ/src/CommonModules/КП_АвтозапускПС/Module.bsl
// Общий модуль (выполняется на стороне сервера) модуля "Конструктор процессов для 1С:УНФ"
// Разработчик Компания "Аналитика. Проекты и решения" +7 495 005-1653, https://kp-unf.ru
// Вызовы являются повторными на время сеанса

#Область СлужебныеПроцедурыИФункции

// Функция возвращает список элементов автозапуска по полному имени типа источника
// Параметры:
//	ПолноеИмяТипа - строка с полным именем типа источника
// Возвращаемое значение: Список значений
Функция ПолучитьСписокАвтозапускаПоНаименованиюИсточника(ПолноеИмяТипа) Экспорт
	
	ПолноеИмя=СтрЗаменить(ПолноеИмяТипа, "Ссылка.", ".");
	
	//найдем в списке метаданных
	СсылкаНаМетаданные=Справочники.КП_СписокМетаданных.НайтиПоРеквизиту("ПолноеНаименование", ПолноеИмя);
	
	Список=Новый СписокЗначений;
	
	Если СсылкаНаМетаданные=Неопределено Тогда
		Возврат Список;
	КонецЕсли;
	
	//получим элементы автозапуска
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	КП_АвтозапускПроцессов.Ссылка КАК Ссылка
	                    |ИЗ
	                    |	Справочник.КП_АвтозапускПроцессов КАК КП_АвтозапускПроцессов
	                    |ГДЕ
	                    |	КП_АвтозапускПроцессов.ПометкаУдаления = ЛОЖЬ
	                    |	И КП_АвтозапускПроцессов.Включено = ИСТИНА
	                    |	И КП_АвтозапускПроцессов.ВидМетаданных = &ВидМетаданных");
	
	Запрос.УстановитьПараметр("ВидМетаданных", СсылкаНаМетаданные);
	Выборка=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.Прямой);
	
	Пока Выборка.Следующий() Цикл
		АвтозапускСсылка=Выборка.Ссылка;
		Если Список.НайтиПоЗначению(АвтозапускСсылка)=Неопределено Тогда
			Список.Добавить(АвтозапускСсылка);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Список;
	
КонецФункции

#КонецОбласти
